{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.7.4r1", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 12, 128, 256], "name": "input_imgs", "sparse": false}, "inbound_nodes": [], "name": "input_imgs"}, {"class_name": "Permute", "config": {"dtype": "float32", "batch_input_shape": [null, 12, 128, 256], "trainable": true, "name": "permute", "dims": [2, 3, 1]}, "inbound_nodes": [[["input_imgs", 0, 0, {}]]], "name": "permute"}, {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 128, 256, 12], "name": "input_1", "sparse": false}, "name": "input_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_out"}}, "name": "stem_conv", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "stem_conv"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["stem_conv", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "stem_bn", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "stem_bn"}, {"class_name": "Activation", "inbound_nodes": [[["stem_bn", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "elu", "trainable": true, "name": "stem_activation"}, "name": "stem_activation"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["stem_activation", 0, 0, {}]]], "config": {"depth_multiplier": 1, "name": "block1a_dwconv", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_out"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "depthwise_regularizer": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block1a_dwconv"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block1a_dwconv", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "block1a_bn", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "block1a_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block1a_bn", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "elu", "trainable": true, "name": "block1a_activation"}, "name": "block1a_activation"}, {"class_name": "Conv2D", "inbound_nodes": [[["block1a_activation", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_out"}}, "name": "block1a_project_conv", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "block1a_project_conv"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block1a_project_conv", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "block1a_project_bn", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "block1a_project_bn"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["block1a_project_bn", 0, 0, {}]]], "config": {"depth_multiplier": 1, "name": "block1b_dwconv", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_out"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "depthwise_regularizer": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block1b_dwconv"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block1b_dwconv", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "block1b_bn", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "block1b_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block1b_bn", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "elu", "trainable": true, "name": "block1b_activation"}, "name": "block1b_activation"}, {"class_name": "Conv2D", "inbound_nodes": [[["block1b_activation", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_out"}}, "name": "block1b_project_conv", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "block1b_project_conv"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block1b_project_conv", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "block1b_project_bn", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "block1b_project_bn"}, {"class_name": "Add", "inbound_nodes": [[["block1b_project_bn", 0, 0, {}], ["block1a_project_bn", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "block1b_add"}, "name": "block1b_add"}, {"class_name": "Conv2D", "inbound_nodes": [[["block1b_add", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_out"}}, "name": "block2a_expand_conv", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "block2a_expand_conv"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block2a_expand_conv", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "block2a_expand_bn", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "block2a_expand_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block2a_expand_bn", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "elu", "trainable": true, "name": "block2a_expand_activation"}, "name": "block2a_expand_activation"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["block2a_expand_activation", 0, 0, {}]]], "config": {"depth_multiplier": 1, "name": "block2a_dwconv", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [2, 2], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_out"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "depthwise_regularizer": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block2a_dwconv"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block2a_dwconv", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "block2a_bn", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "block2a_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block2a_bn", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "elu", "trainable": true, "name": "block2a_activation"}, "name": "block2a_activation"}, {"class_name": "Conv2D", "inbound_nodes": [[["block2a_activation", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_out"}}, "name": "block2a_project_conv", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 24, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "block2a_project_conv"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block2a_project_conv", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "block2a_project_bn", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "block2a_project_bn"}, {"class_name": "Conv2D", "inbound_nodes": [[["block2a_project_bn", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_out"}}, "name": "block2b_expand_conv", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 144, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "block2b_expand_conv"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block2b_expand_conv", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "block2b_expand_bn", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "block2b_expand_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block2b_expand_bn", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "elu", "trainable": true, "name": "block2b_expand_activation"}, "name": "block2b_expand_activation"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["block2b_expand_activation", 0, 0, {}]]], "config": {"depth_multiplier": 1, "name": "block2b_dwconv", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_out"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "depthwise_regularizer": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block2b_dwconv"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block2b_dwconv", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "block2b_bn", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "block2b_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block2b_bn", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "elu", "trainable": true, "name": "block2b_activation"}, "name": "block2b_activation"}, {"class_name": "Conv2D", "inbound_nodes": [[["block2b_activation", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_out"}}, "name": "block2b_project_conv", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 24, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "block2b_project_conv"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block2b_project_conv", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "block2b_project_bn", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "block2b_project_bn"}, {"class_name": "Add", "inbound_nodes": [[["block2b_project_bn", 0, 0, {}], ["block2a_project_bn", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "block2b_add"}, "name": "block2b_add"}, {"class_name": "Conv2D", "inbound_nodes": [[["block2b_add", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_out"}}, "name": "block2c_expand_conv", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 144, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "block2c_expand_conv"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block2c_expand_conv", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "block2c_expand_bn", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "block2c_expand_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block2c_expand_bn", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "elu", "trainable": true, "name": "block2c_expand_activation"}, "name": "block2c_expand_activation"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["block2c_expand_activation", 0, 0, {}]]], "config": {"depth_multiplier": 1, "name": "block2c_dwconv", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_out"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "depthwise_regularizer": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block2c_dwconv"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block2c_dwconv", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "block2c_bn", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "block2c_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block2c_bn", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "elu", "trainable": true, "name": "block2c_activation"}, "name": "block2c_activation"}, {"class_name": "Conv2D", "inbound_nodes": [[["block2c_activation", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_out"}}, "name": "block2c_project_conv", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 24, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "block2c_project_conv"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block2c_project_conv", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "block2c_project_bn", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "block2c_project_bn"}, {"class_name": "Add", "inbound_nodes": [[["block2c_project_bn", 0, 0, {}], ["block2b_add", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "block2c_add"}, "name": "block2c_add"}, {"class_name": "Conv2D", "inbound_nodes": [[["block2c_add", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_out"}}, "name": "block3a_expand_conv", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 144, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "block3a_expand_conv"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block3a_expand_conv", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "block3a_expand_bn", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "block3a_expand_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block3a_expand_bn", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "elu", "trainable": true, "name": "block3a_expand_activation"}, "name": "block3a_expand_activation"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["block3a_expand_activation", 0, 0, {}]]], "config": {"depth_multiplier": 1, "name": "block3a_dwconv", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [2, 2], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_out"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "depthwise_regularizer": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [5, 5]}, "name": "block3a_dwconv"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block3a_dwconv", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "block3a_bn", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "block3a_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block3a_bn", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "elu", "trainable": true, "name": "block3a_activation"}, "name": "block3a_activation"}, {"class_name": "Conv2D", "inbound_nodes": [[["block3a_activation", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_out"}}, "name": "block3a_project_conv", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 48, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "block3a_project_conv"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block3a_project_conv", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "block3a_project_bn", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "block3a_project_bn"}, {"class_name": "Conv2D", "inbound_nodes": [[["block3a_project_bn", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_out"}}, "name": "block3b_expand_conv", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 288, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "block3b_expand_conv"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block3b_expand_conv", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "block3b_expand_bn", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "block3b_expand_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block3b_expand_bn", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "elu", "trainable": true, "name": "block3b_expand_activation"}, "name": "block3b_expand_activation"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["block3b_expand_activation", 0, 0, {}]]], "config": {"depth_multiplier": 1, "name": "block3b_dwconv", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_out"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "depthwise_regularizer": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [5, 5]}, "name": "block3b_dwconv"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block3b_dwconv", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "block3b_bn", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "block3b_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block3b_bn", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "elu", "trainable": true, "name": "block3b_activation"}, "name": "block3b_activation"}, {"class_name": "Conv2D", "inbound_nodes": [[["block3b_activation", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_out"}}, "name": "block3b_project_conv", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 48, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "block3b_project_conv"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block3b_project_conv", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "block3b_project_bn", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "block3b_project_bn"}, {"class_name": "Add", "inbound_nodes": [[["block3b_project_bn", 0, 0, {}], ["block3a_project_bn", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "block3b_add"}, "name": "block3b_add"}, {"class_name": "Conv2D", "inbound_nodes": [[["block3b_add", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_out"}}, "name": "block3c_expand_conv", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 288, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "block3c_expand_conv"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block3c_expand_conv", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "block3c_expand_bn", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "block3c_expand_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block3c_expand_bn", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "elu", "trainable": true, "name": "block3c_expand_activation"}, "name": "block3c_expand_activation"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["block3c_expand_activation", 0, 0, {}]]], "config": {"depth_multiplier": 1, "name": "block3c_dwconv", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_out"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "depthwise_regularizer": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [5, 5]}, "name": "block3c_dwconv"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block3c_dwconv", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "block3c_bn", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "block3c_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block3c_bn", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "elu", "trainable": true, "name": "block3c_activation"}, "name": "block3c_activation"}, {"class_name": "Conv2D", "inbound_nodes": [[["block3c_activation", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_out"}}, "name": "block3c_project_conv", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 48, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "block3c_project_conv"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block3c_project_conv", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "block3c_project_bn", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "block3c_project_bn"}, {"class_name": "Add", "inbound_nodes": [[["block3c_project_bn", 0, 0, {}], ["block3b_add", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "block3c_add"}, "name": "block3c_add"}, {"class_name": "Conv2D", "inbound_nodes": [[["block3c_add", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_out"}}, "name": "block4a_expand_conv", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 288, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "block4a_expand_conv"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block4a_expand_conv", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "block4a_expand_bn", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "block4a_expand_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block4a_expand_bn", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "elu", "trainable": true, "name": "block4a_expand_activation"}, "name": "block4a_expand_activation"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["block4a_expand_activation", 0, 0, {}]]], "config": {"depth_multiplier": 1, "name": "block4a_dwconv", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [2, 2], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_out"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "depthwise_regularizer": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block4a_dwconv"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block4a_dwconv", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "block4a_bn", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "block4a_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block4a_bn", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "elu", "trainable": true, "name": "block4a_activation"}, "name": "block4a_activation"}, {"class_name": "Conv2D", "inbound_nodes": [[["block4a_activation", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_out"}}, "name": "block4a_project_conv", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 88, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "block4a_project_conv"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block4a_project_conv", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "block4a_project_bn", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "block4a_project_bn"}, {"class_name": "Conv2D", "inbound_nodes": [[["block4a_project_bn", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_out"}}, "name": "block4b_expand_conv", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 528, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "block4b_expand_conv"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block4b_expand_conv", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "block4b_expand_bn", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "block4b_expand_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block4b_expand_bn", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "elu", "trainable": true, "name": "block4b_expand_activation"}, "name": "block4b_expand_activation"}, {"class_name": "DepthwiseConv2D", "inbound_nodes": [[["block4b_expand_activation", 0, 0, {}]]], "config": {"depth_multiplier": 1, "name": "block4b_dwconv", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "depthwise_constraint": null, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_out"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "depthwise_regularizer": null, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "block4b_dwconv"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block4b_dwconv", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "block4b_bn", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "block4b_bn"}, {"class_name": "Activation", "inbound_nodes": [[["block4b_bn", 0, 0, {}]]], "config": {"dtype": "float32", "activation": "elu", "trainable": true, "name": "block4b_activation"}, "name": "block4b_activation"}, {"class_name": "Conv2D", "inbound_nodes": [[["block4b_activation", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_out"}}, "name": "block4b_project_conv", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 88, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "block4b_project_conv"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block4b_project_conv", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "block4b_project_bn", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": [3]}, "name": "block4b_project_bn"}, {"class_name": "Add", "inbound_nodes": [[["block4b_project_bn", 0, 0, {}], ["block4a_project_bn", 0, 0, {}]]], "config": {"dtype": "float32", "trainable": true, "name": "block4b_add"}, "name": "block4b_add"}, {"class_name": "Conv2D", "inbound_nodes": [[["block4b_add", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"dtype": "float32", "distribution": "truncated_normal", "scale": 2.0, "seed": null, "mode": "fan_out"}}, "name": "block4c_expand_conv", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 528, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "block4c_expand_conv"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["block4c_expand_conv", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "name": "block4c_expand_bn", "gamma_regularizer": null, "dtype": "float32", "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, 